<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#OVERVIEW" data-toc-modified-id="OVERVIEW-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>OVERVIEW</a></span><ul class="toc-item"><li><span><a href="#GROUPBY-MULTIPLE-COLUMNS" data-toc-modified-id="GROUPBY-MULTIPLE-COLUMNS-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>GROUPBY MULTIPLE COLUMNS</a></span></li><li><span><a href="#GROUP-BY-ANOTHER-SERIES" data-toc-modified-id="GROUP-BY-ANOTHER-SERIES-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>GROUP BY ANOTHER SERIES</a></span></li><li><span><a href="#SPEED-UP-GROUPBY-by-CATEGORICAL-DATA" data-toc-modified-id="SPEED-UP-GROUPBY-by-CATEGORICAL-DATA-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>SPEED UP GROUPBY by CATEGORICAL DATA</a></span></li></ul></li><li><span><a href="#GROUPBY-AND-AGGREGATION" data-toc-modified-id="GROUPBY-AND-AGGREGATION-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>GROUPBY AND AGGREGATION</a></span><ul class="toc-item"><li><span><a href="#MULTIPLE-AGGREGATIONS" data-toc-modified-id="MULTIPLE-AGGREGATIONS-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>MULTIPLE AGGREGATIONS</a></span></li><li><span><a href="#CUSTOM-AGGREGATION-BY-1-FUNCTION" data-toc-modified-id="CUSTOM-AGGREGATION-BY-1-FUNCTION-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>CUSTOM AGGREGATION BY 1 FUNCTION</a></span></li><li><span><a href="#CUSTOM-AGGREGATION-BY-MULTIPLE-FUNCTIONS" data-toc-modified-id="CUSTOM-AGGREGATION-BY-MULTIPLE-FUNCTIONS-2.3"><span class="toc-item-num">2.3&nbsp;&nbsp;</span>CUSTOM AGGREGATION BY MULTIPLE FUNCTIONS</a></span></li><li><span><a href="#GROUPING-ON-FUNCTION-OF-INDEX" data-toc-modified-id="GROUPING-ON-FUNCTION-OF-INDEX-2.4"><span class="toc-item-num">2.4&nbsp;&nbsp;</span>GROUPING ON FUNCTION OF INDEX</a></span></li></ul></li><li><span><a href="#GROUPBY-AND-TRANSFORMATION" data-toc-modified-id="GROUPBY-AND-TRANSFORMATION-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>GROUPBY AND TRANSFORMATION</a></span><ul class="toc-item"><li><span><a href="#DETECTING-OUTLIERS-WITH-Z-SCORE" data-toc-modified-id="DETECTING-OUTLIERS-WITH-Z-SCORE-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>DETECTING OUTLIERS WITH Z-SCORE</a></span></li><li><span><a href="#FILLING-MISSING-DATA" data-toc-modified-id="FILLING-MISSING-DATA-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>FILLING MISSING DATA</a></span></li></ul></li><li><span><a href="#GROUPBY-AND-FILTER" data-toc-modified-id="GROUPBY-AND-FILTER-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>GROUPBY AND FILTER</a></span><ul class="toc-item"><li><span><a href="#GROUPBY-AND-FILTER-WITH-.APPLY()" data-toc-modified-id="GROUPBY-AND-FILTER-WITH-.APPLY()-4.1"><span class="toc-item-num">4.1&nbsp;&nbsp;</span>GROUPBY AND FILTER WITH .APPLY()</a></span></li><li><span><a href="#GROUPBY-AND-FILTER-WITH-.FILTER()" data-toc-modified-id="GROUPBY-AND-FILTER-WITH-.FILTER()-4.2"><span class="toc-item-num">4.2&nbsp;&nbsp;</span>GROUPBY AND FILTER WITH .FILTER()</a></span></li><li><span><a href="#GROUPBY-AND-FILTER-WITH-.MAP()" data-toc-modified-id="GROUPBY-AND-FILTER-WITH-.MAP()-4.3"><span class="toc-item-num">4.3&nbsp;&nbsp;</span>GROUPBY AND FILTER WITH .MAP()</a></span></li></ul></li><li><span><a href="#BREAKDOWN-GROUPBY-OBJECT" data-toc-modified-id="BREAKDOWN-GROUPBY-OBJECT-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>BREAKDOWN GROUPBY OBJECT</a></span></li></ul></div>

In [1]:
import pandas as pd
titanic = pd.read_csv('titanic.csv')
titanic.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

### OVERVIEW

#### GROUPBY MULTIPLE COLUMNS

In [2]:
# Group titanic by 'pclass'
by_class = titanic.groupby("pclass")

# Aggregate 'survived' column of by_class by count
count_by_class = by_class["survived"].count()

# Print count_by_class
print(count_by_class)

pclass
1    323
2    277
3    709
Name: survived, dtype: int64

In [3]:
# Group titanic by 'embarked' and 'pclass'
by_mult = titanic.groupby(["embarked", "pclass"])

# Aggregate 'survived' column of by_mult by count
count_mult = by_mult["survived"].count()

# Print count_mult
print(count_mult)

embarked  pclass
C         1         141
          2          28
          3         101
Q         1           3
          2           7
          3         113
S         1         177
          2         242
          3         495
Name: survived, dtype: int64

#### GROUP BY ANOTHER SERIES

In [4]:
sales = pd.DataFrame({'weekday': ['Sun', 'Sun', 'Mon', 'Mon'],
                      'city': ['Austin', 'Dallas', 'Austin', 'Dallas'],
                      'bread': [139, 237, 326, 456],
                      'butter': [20, 45, 70, 98]})
customers = pd.Series(['Dave','Alice','Bob','Alice'])
sales.groupby(customers)['bread'].sum()

Alice    693
Bob      326
Dave     139
Name: bread, dtype: int64

#### SPEED UP GROUPBY by CATEGORICAL DATA

In [5]:
# Find unique values
sales['weekday'].unique()

array(['Sun', 'Mon'], dtype=object)

In [6]:
# Change to categorical data
sales['weekday'] = sales['weekday'].astype('category')

sales['weekday']

0    Sun
1    Sun
2    Mon
3    Mon
Name: weekday, dtype: category
Categories (2, object): [Mon, Sun]

### GROUPBY AND AGGREGATION

#### MULTIPLE AGGREGATIONS

In [7]:
# Aggregate max and sum for bread and butter groupby city
sales.groupby('city')[['bread','butter']].agg(['max','sum'])

       bread      butter
         max  sum    max  sum
city
Austin   326  465     70   90
Dallas   456  693     98  143

#### CUSTOM AGGREGATION BY 1 FUNCTION

In [8]:
# Define function (I cannot use lambda here)
def data_range(series):
    return series.max() - series.min()

# Use function in groupby
sales.groupby('weekday')[['bread', 'butter']].agg(data_range)

         bread  butter
weekday
Mon        130      28
Sun         98      25

#### CUSTOM AGGREGATION BY MULTIPLE FUNCTIONS

In [9]:
sales.groupby(customers)[['bread', 'butter']].agg({'bread':'sum', 'butter':data_range})

       bread  butter
Alice    693      53
Bob      326       0
Dave     139       0

#### GROUPING ON FUNCTION OF INDEX

In [11]:
# Read file: sales1
sales1 = pd.read_csv("sales-feb-2015.csv", index_col="Date", parse_dates=True)

sales1.head()

                             Company   Product  Units
Date
2015-02-02 08:30:00            Hooli  Software      3
2015-02-02 21:00:00        Mediacore  Hardware      9
2015-02-03 14:00:00          Initech  Software     13
2015-02-04 15:30:00        Streeplex  Software     13
2015-02-04 22:00:00  Acme Coporation  Hardware     14

In [12]:
# Create a groupby object: by_day
by_day = sales1.groupby(sales1.index.strftime("%a"))

# Create sum: units_sum
units_sum = by_day["Units"].sum()

# Print units_sum
print(units_sum)

Mon    48
Sat     7
Thu    59
Tue    13
Wed    48
Name: Units, dtype: int64

### GROUPBY AND TRANSFORMATION

#### DETECTING OUTLIERS WITH Z-SCORE

In [13]:
auto = pd.read_csv('auto-mpg.csv')

auto.head()

    mpg  cyl  displ   hp  weight  accel  yr origin                       name
0  18.0    8  307.0  130    3504   12.0  70     US  chevrolet chevelle malibu
1  15.0    8  350.0  165    3693   11.5  70     US          buick skylark 320
2  18.0    8  318.0  150    3436   11.0  70     US         plymouth satellite
3  16.0    8  304.0  150    3433   12.0  70     US              amc rebel sst
4  17.0    8  302.0  140    3449   10.5  70     US                ford torino

In [14]:
# Define z-score
def zscore(series):
    return (series - series.mean()) / series.std()

# Define transformation and aggregation function
def zscore_with_year_and_name(group):
    df = pd.DataFrame({'mpg': zscore(group['mpg']),
                       'year': group['yr'],
                       'name': group['name']})
    return df

# Apply transformation and aggregation
auto.groupby('yr').apply(zscore_with_year_and_name).head()

        mpg  year                       name
0  0.058125    70  chevrolet chevelle malibu
1 -0.503753    70          buick skylark 320
2  0.058125    70         plymouth satellite
3 -0.316460    70              amc rebel sst
4 -0.129168    70                ford torino

#### FILLING MISSING DATA

In [16]:
# Create a groupby object: by_sex_class
by_sex_class = titanic.groupby(["sex", "pclass"])

# Write a function that imputes median
def impute_median(series):
    return series.fillna(series.median())

# Impute age and assign to titanic['age']
titanic.age = by_sex_class["age"].transform(impute_median)

# Print the output of titanic.tail(10)
print(titanic.tail(5))

      pclass  survived                       name     sex   age  sibsp  parch  \
1304       3         0       Zabour, Miss. Hileni  female  14.5      1      0
1305       3         0      Zabour, Miss. Thamine  female  22.0      1      0
1306       3         0  Zakarian, Mr. Mapriededer    male  26.5      0      0
1307       3         0        Zakarian, Mr. Ortin    male  27.0      0      0
1308       3         0         Zimmerman, Mr. Leo    male  29.0      0      0

      ticket     fare cabin embarked boat   body home.dest
1304    2665  14.4542   NaN        C  NaN  328.0       NaN
1305    2665  14.4542   NaN        C  NaN    NaN       NaN
1306    2656   7.2250   NaN        C  NaN  304.0       NaN
1307    2670   7.2250   NaN        C  NaN    NaN       NaN
1308  315082   7.8750   NaN        S  NaN    NaN       NaN

### GROUPBY AND FILTER
#### GROUPBY AND FILTER WITH .APPLY()

In [19]:
titanic.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [17]:
# Define function
def c_deck_survival(gr):
    c_passengers = gr['cabin'].str.startswith('C').fillna(False)
    return gr.loc[c_passengers, 'survived'].mean()

# Create a groupby object using titanic over the 'sex' column: by_sex
by_sex = titanic.groupby("sex")

# Call by_sex.apply with the function c_deck_survival and print the result
c_surv_by_sex = by_sex.apply(c_deck_survival)

# Print the survival rates
print(c_surv_by_sex)

sex
female    0.913043
male      0.312500
dtype: float64

#### GROUPBY AND FILTER WITH .FILTER()

In [21]:
sales = pd.read_csv('sales-feb-2015.csv', index_col = 'Date', parse_dates = True)

sales.head()

                             Company   Product  Units
Date
2015-02-02 08:30:00            Hooli  Software      3
2015-02-02 21:00:00        Mediacore  Hardware      9
2015-02-03 14:00:00          Initech  Software     13
2015-02-04 15:30:00        Streeplex  Software     13
2015-02-04 22:00:00  Acme Coporation  Hardware     14

In [20]:
# Group sales by 'Company': by_company
by_company = sales.groupby("Company")

# Compute the sum of the 'Units' of by_company: by_com_sum
by_com_sum = by_company["Units"].sum()
print(by_com_sum)

# Filter 'Units' where the sum is > 35: by_com_filt
by_com_filt = by_company.filter(lambda g:g["Units"].sum() > 35)
print(by_com_filt)

Company
Acme Coporation    34
Hooli              30
Initech            30
Mediacore          45
Streeplex          36
Name: Units, dtype: int64
                       Company   Product  Units
Date
2015-02-02 21:00:00  Mediacore  Hardware      9
2015-02-04 15:30:00  Streeplex  Software     13
2015-02-09 09:00:00  Streeplex   Service     19
2015-02-09 13:00:00  Mediacore  Software      7
2015-02-19 11:00:00  Mediacore  Hardware     16
2015-02-19 16:00:00  Mediacore   Service     10
2015-02-21 05:00:00  Mediacore  Software      3
2015-02-26 09:00:00  Streeplex   Service      4

#### GROUPBY AND FILTER WITH .MAP()

In [22]:
# Create the Boolean Series: under10
under10 = (titanic['age'] < 10).map({True:'under 10', False:'over 10'})

# Group by under10 and compute the survival rate
survived_mean_1 = titanic.groupby(under10).survived.mean()
print(survived_mean_1)

# Group by under10 and pclass and compute the survival rate
survived_mean_2 = titanic.groupby([under10, "pclass"]).survived.mean()
print(survived_mean_2)

age
over 10     0.366748
under 10    0.609756
Name: survived, dtype: float64
age       pclass
over 10   1         0.617555
          2         0.380392
          3         0.238897
under 10  1         0.750000
          2         1.000000
          3         0.446429
Name: survived, dtype: float64

### BREAKDOWN GROUPBY OBJECT

In [23]:
# Create a groupby object
splitting = auto.groupby('yr')

In [25]:
# Type of groupby object
type(splitting)

pandas.core.groupby.groupby.DataFrameGroupBy

In [26]:
# Type of groupby object
type(splitting.groups)

dict

In [27]:
# Type of groupby object
print(splitting.groups.keys())

dict_keys([70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82])

In [28]:
# Group by aggregation
splitting['mpg'].mean()

yr
70    17.689655
71    21.111111
72    18.714286
73    17.100000
74    22.769231
75    20.266667
76    21.573529
77    23.375000
78    24.061111
79    25.093103
80    33.803704
81    30.185714
82    32.000000
Name: mpg, dtype: float64

In [29]:
# Above aggregation equivalent to
for group_name, group in splitting:
    avg = group['mpg'].mean()
    print(group_name, avg)

70 17.689655172413794
71 21.11111111111111
72 18.714285714285715
73 17.1
74 22.76923076923077
75 20.266666666666666
76 21.573529411764707
77 23.375
78 24.061111111111114
79 25.09310344827585
80 33.803703703703704
81 30.185714285714287
82 32.0

In [30]:
# And we can filter in iteration
for group_name, group in splitting:
    avg = group.loc[group['name'].str.contains('chevrolet'), 'mpg'].mean()
    print(group_name, avg)

70 15.666666666666666
71 20.25
72 15.333333333333334
73 14.833333333333334
74 18.666666666666668
75 17.666666666666668
76 23.25
77 20.25
78 23.233333333333334
79 21.666666666666668
80 30.05
81 23.5
82 29.0

In [31]:
# This can be done in list comprehension
chevy_means = {year:group.loc[group['name'].str.contains('chevrolet'),'mpg'].mean() for year,group in splitting}
pd.Series(chevy_means)

70    15.666667
71    20.250000
72    15.333333
73    14.833333
74    18.666667
75    17.666667
76    23.250000
77    20.250000
78    23.233333
79    21.666667
80    30.050000
81    23.500000
82    29.000000
dtype: float64